Revit 2024 API
Transform2D.CreateIdentity Method
 Creates the identity transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static Transform2D CreateIdentity()
Visual Basic
Public Shared Function CreateIdentity As Transform2D
Visual C++
public:
static Transform2D^ CreateIdentity()
Return Value
 The identity transformation.
Remarks
 The identity transformation does not change a point or a vector that it is applied to.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace